ERP.belugaerp/src/Documents/КорректировкаПриобретения/КорректировкаПриобретения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КорректировкаПриобретения</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>бг_ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДолжностьПредседателяКомиссии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДолжностьЧленаКомиссии1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДолжностьЧленаКомиссии2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДолжностьЧленаКомиссии3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ПредседательКомиссии</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Руководитель</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЧленКомиссии1</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЧленКомиссии2</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЧленКомиссии3</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections>
    <name>Расхождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>бг_КоличествоБой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>бг_КоличествоБрак</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>бг_КоличествоНедостача</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>бг_КоличествоИзлишек</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Documents/КорректировкаПриобретения/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	бг_ДобавитьРеквизитыПотерьПриРасхождениях();
	бг_ДобавитьКнопкуРеквизитыПечатиАктаОРасхождениях();
	
КонецПроцедуры

&НаКлиенте
Процедура бг_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Документ.КорректировкаПриобретения.Форма.бг_РеквизитыПечати" Тогда
		
		Если ВыбранноеЗначение <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Объект, ВыбранноеЗначение);
		КонецЕсли;
		
		Модифицированность = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура бг_КоличествоБойБракПриИзменении(Элемент) 
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;	
	
	КоличествоПотери = ТекущиеДанные.бг_КоличествоБой + ТекущиеДанные.бг_КоличествоБрак;
	КоличествоРасхождение = ?(
		ТекущиеДанные.КоличествоУпаковок < 0, 
		-ТекущиеДанные.КоличествоУпаковок, 
		ТекущиеДанные.КоличествоУпаковок);		
	
	Если КоличествоПотери > КоличествоРасхождение Тогда
		
		ТекущиеДанные[Элемент.Имя] = 0;
		
		ТекстОшибки = НСтр("ru='Общее количество боя или брака не может превышать количества расхождения по документу'");
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ТекстОшибки,,, 
			"Объект.Расхождения[" + Строка(ТекущиеДанные.НомерСтроки - 1) + "]." + Элемент.Имя); 
		
	КонецЕсли;	
	
	РассчитываемаяСтрока = ?(
		ТекущиеДанные.КоличествоУпаковок < 0, 
		"бг_КоличествоНедостача", 
		"бг_КоличествоИзлишек");
		
	ТекущиеДанные[РассчитываемаяСтрока] = КоличествоРасхождение 
											- ТекущиеДанные.бг_КоличествоБой 
											- ТекущиеДанные.бг_КоличествоБрак;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура бг_ОткрытьРеквизитыПечати(Команда)
	
	ОткрытьФорму(
		"Документ.КорректировкаПриобретения.Форма.бг_РеквизитыПечати", 
		Новый Структура("ДокументОбъект", Объект), 
		ЭтотОбъект);	
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура бг_ДобавитьРеквизитыПотерьПриРасхождениях()
	
	// количество бой
	бг_КоличествоБой = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
							ЭтотОбъект, 
							"бг_КоличествоБой", 
							Элементы.Расхождения, 
							"Объект.Расхождения.бг_КоличествоБой",, 
							Элементы.РасхожденияУпаковкаЕдиницаИзмерения);	

	бг_КоличествоБой.УстановитьДействие("ПриИзменении", "бг_КоличествоБойБракПриИзменении");
	
	// количество брак
	бг_КоличествоБрак = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
							ЭтотОбъект, 
							"бг_КоличествоБрак", 
							Элементы.Расхождения, 
							"Объект.Расхождения.бг_КоличествоБрак",, 
							Элементы.РасхожденияУпаковкаЕдиницаИзмерения);
		
	бг_КоличествоБрак.УстановитьДействие("ПриИзменении", "бг_КоличествоБойБракПриИзменении");
	
	// количество недостача
	бг_КоличествоНедостача = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
								ЭтотОбъект, 
								"бг_КоличествоНедостача", 
								Элементы.Расхождения, 
								"Объект.Расхождения.бг_КоличествоНедостача",, 
								Элементы.РасхожденияУпаковкаЕдиницаИзмерения);
								
	бг_КоличествоНедостача.ТолькоПросмотр = Истина;
	
	// количество излишек
	бг_КоличествоИзлишек = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
								ЭтотОбъект, 
								"бг_КоличествоИзлишек", 
								Элементы.Расхождения, 
								"Объект.Расхождения.бг_КоличествоИзлишек",, 
								Элементы.РасхожденияУпаковкаЕдиницаИзмерения);
								
	бг_КоличествоИзлишек.ТолькоПросмотр = Истина;

КонецПроцедуры	

&НаСервере
Процедура бг_ДобавитьКнопкуРеквизитыПечатиАктаОРасхождениях()  
	
	бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьКнопкуНаФорму(
		ЭтотОбъект, 
		"бг_РеквизитыПечатиАктаОРасхождениях", 
		Элементы.ГруппаПараметрыЛево, 
		"Реквизиты печати (акт о расхождениях)",
		"бг_ОткрытьРеквизитыПечати", 
		"бг_ОткрытьРеквизитыПечати",, 
		ВидКнопкиФормы.Гиперссылка);	
	
КонецПроцедуры	

#КонецОбласти
